[D1023_work_김현우]

문제 1. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요. <hr>

In [2]:
import pandas as pd

In [3]:
# (1-1) 종목명, PER, PBR 컬럼만 선택 후 DataFrame으로 저장하는 코드 작성하세요.

data = [["2차전지(생산)", "SK이노베이션", 10.19, 1.29], 
        ["해운", "팬오션", 21.23, 0.95], 
        ["시스템반도체", "티엘아이", 35.97, 1.12], 
        ["해운", "HMM", 21.52, 3.20], 
        ["시스템반도체", "아이에이", 37.32, 3.55], 
        ["2차전지(생산)", "LG화학", 83.06, 3.75]]

columns = ["테마", "종목명", "PER", "PBR"]

dataDF = pd.DataFrame(data, columns=columns)
display(dataDF)

bool_index = ["종목명", "PER", "PBR"]
ret_data = dataDF[bool_index]
display(ret_data)

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
1        해운      팬오션  21.23  0.95
2    시스템반도체     티엘아이  35.97  1.12
3        해운      HMM  21.52  3.20
4    시스템반도체     아이에이  37.32  3.55
5  2차전지(생산)     LG화학  83.06  3.75

       종목명    PER   PBR
0  SK이노베이션  10.19  1.29
1      팬오션  21.23  0.95
2     티엘아이  35.97  1.12
3      HMM  21.52  3.20
4     아이에이  37.32  3.55
5     LG화학  83.06  3.75

In [4]:
# (1-2) PER이 20미만, 50이상인 데이터만 저장하는 코드 작성하세요.

retDF = (dataDF['PER'] < 20) | (dataDF['PER'] >= 50)
ret_data = dataDF[retDF]
display(ret_data)

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
5  2차전지(생산)     LG화학  83.06  3.75

In [5]:
# (1-3) 종목명을 행인덱스로 설정하는 코드 작성하세요.

dataDF = dataDF.set_index('종목명')
display(dataDF)

               테마    PER   PBR
종목명
SK이노베이션  2차전지(생산)  10.19  1.29
팬오션            해운  21.23  0.95
티엘아이       시스템반도체  35.97  1.12
HMM            해운  21.52  3.20
아이에이       시스템반도체  37.32  3.55
LG화학     2차전지(생산)  83.06  3.75

In [6]:
# (1-4) PBR 컬럼의 데이터를 기준으로 내림차순 정렬해 주세요.
dataDF = dataDF.sort_values(by = 'PBR', ascending = False)
display(dataDF)

               테마    PER   PBR
종목명
LG화학     2차전지(생산)  83.06  3.75
아이에이       시스템반도체  37.32  3.55
HMM            해운  21.52  3.20
SK이노베이션  2차전지(생산)  10.19  1.29
티엘아이       시스템반도체  35.97  1.12
팬오션            해운  21.23  0.95

In [7]:
# (1-5) PBR, PER 순서로 오름차순 정렬해 주세요.
dateDF = dataDF.sort_values(by = ['PBR', 'PER'], ascending = [True, True])
display(dataDF)

               테마    PER   PBR
종목명
LG화학     2차전지(생산)  83.06  3.75
아이에이       시스템반도체  37.32  3.55
HMM            해운  21.52  3.20
SK이노베이션  2차전지(생산)  10.19  1.29
티엘아이       시스템반도체  35.97  1.12
팬오션            해운  21.23  0.95

문제 2. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요. <hr>

In [8]:
data = [["037730", "3R", 1510, 7.36], 
        ["036360", "3SOFT", 1790, 1.65], 
        ["005760", "ACTS", 1185, 1.28]]

columns = ["종목코드", "종목명", "현재가", "등락률"]

dataDF = pd.DataFrame(data, columns=columns)
display(dataDF)

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005760   ACTS  1185  1.28

In [9]:
# (2-1) "종목코드"를 행 인덱스로 설정하세요.

ret_data = dataDF.set_index("종목코드")
display(ret_data)

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [10]:
# (2-2) 아래 결과가 출력되도록 코드 작성하세요. 
#        종목명 현재가
# 종목코드
# 037730 3R    1510
# 036360 3SOFT 1790

ret_data = ret_data.drop(index = '005760', columns = '등락률')
display(ret_data)

          종목명   현재가
종목코드
037730     3R  1510
036360  3SOFT  1790

In [11]:
# (2-3) 현재가가 1,500원 이상이면서 1,700원 미만인 값만 출력하세요.

ret_data = (dataDF['현재가'] >= 1500) & (dataDF['현재가'] < 1700)

display(dataDF[ret_data])

     종목코드 종목명   현재가   등락률
0  037730  3R  1510  7.36

In [12]:
# (2-4) 목표가는 현재가에서 10% 상승한 가격으로 목표가 컬럼을 추가하세요.

ret_data = dataDF.copy()
ret_data['목표가'] = ret_data['현재가'] * 1.10
display(ret_data)

     종목코드    종목명   현재가   등락률     목표가
0  037730     3R  1510  7.36  1661.0
1  036360  3SOFT  1790  1.65  1969.0
2  005760   ACTS  1185  1.28  1303.5

In [13]:
# (2-5) 아래 LG 데이터를 추가하세요. 
# 종목코드 종목명 현재가 등락률
# 066570 LG전자 60000 3.84

dataDF.loc[3] = ['066570', 'LG전자', '60000', '3.84']
display(dataDF)

     종목코드    종목명    현재가   등락률
0  037730     3R   1510  7.36
1  036360  3SOFT   1790  1.65
2  005760   ACTS   1185  1.28
3  066570   LG전자  60000  3.84

문제 3. 아래 데이터를 저장 후 조건에 맞도록 코드를 작성하세요. <hr>

In [14]:
import numpy as np

In [15]:
data = {"카카오": [np.nan, 221, 35], 
        "NAVER": [52, 47, 3]}

index = [2019, 2020, 2021]

dataDF = pd.DataFrame(data, index)
display(dataDF)

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [16]:
# (3-1) NAVER 컬럼 삭제해 주세요.

ret_data = dataDF.drop('NAVER', axis = 1)
display(ret_data)

        카카오
2019    NaN
2020  221.0
2021   35.0

In [17]:
# (3-2) "삼성전자": [17, 21, 13] 데이터를 추가해 주세요.

dataDF['삼성전자'] = [17, 21, 13]
display(dataDF)

        카카오  NAVER  삼성전자
2019    NaN     52    17
2020  221.0     47    21
2021   35.0      3    13

In [18]:
# (3-3) 컬럼명을 기준으로 내림차순 정렬해 주세요.

dataDF = dataDF.sort_index(axis = 1, ascending=False)
display(dataDF)

        카카오  삼성전자  NAVER
2019    NaN    17     52
2020  221.0    21     47
2021   35.0    13      3

In [19]:
# (3-4) 아래 형태가 되도록 코드 작성 하세요
#       2019 2020  2021
# 카카오 NaN  221.0 35.0
# NAVER 52.0 47.0

dataDF = dataDF.transpose()
display(dataDF)

dataDF = dataDF.T
display(dataDF)

       2019   2020  2021
카카오     NaN  221.0  35.0
삼성전자   17.0   21.0  13.0
NAVER  52.0   47.0   3.0

        카카오  삼성전자  NAVER
2019    NaN  17.0   52.0
2020  221.0  21.0   47.0
2021   35.0  13.0    3.0

In [20]:
# 문제 4. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요.
FILE_NAME = '../Data/vgsales.csv'

dataDF = pd.read_csv(FILE_NAME)
display(dataDF)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [21]:
# (4-1) 'Rank' 컬럼을 인덱스로 설정하면서 DataFrame으로 변환하세요.

dataDF = dataDF.set_index('Rank')
display(dataDF)
type(dataDF)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...
16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

pandas.core.frame.DataFrame

In [22]:
# (4-2) 'Global_Sales' 컬럼을 기준으로 내림차순 정렬하세요.

dataDF = dataDF.sort_values(by='Global_Sales', ascending=False)
display(dataDF)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...
16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [23]:
# (4-3) 'Platform'과 'Global_Sales'를 기준으로 정렬하세요. 
#       'Platform'은 오름차순으로 정렬하고 'Global_Sales'는 내림차순으로 정렬

dataDF = dataDF.sort_values(by=['Platform', 'Global_Sales'], ascending=[True, False])
display(dataDF)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
90,Pac-Man,2600,1982.0,Puzzle,Atari,7.28,0.45,0.0,0.08,7.81
240,Pitfall!,2600,1981.0,Platform,Activision,4.21,0.24,0.0,0.05,4.50
259,Asteroids,2600,1980.0,Shooter,Atari,4.00,0.26,0.0,0.05,4.31
545,Missile Command,2600,1980.0,Shooter,Atari,2.56,0.17,0.0,0.03,2.76
608,Space Invaders,2600,NaN,Shooter,Atari,2.36,0.14,0.0,0.03,2.53
...,...,...,...,...,...,...,...,...,...,...
16533,Sébastien Loeb Rally Evo,XOne,2016.0,Racing,Milestone S.r.l,0.00,0.01,0.0,0.00,0.01
16534,Hitman (2016),XOne,2016.0,Action,Square Enix,0.00,0.01,0.0,0.00,0.01
16565,Mighty No. 9,XOne,2016.0,Platform,Deep Silver,0.01,0.00,0.0,0.00,0.01
16572,Resident Evil 4 HD,XOne,2016.0,Shooter,Capcom,0.01,0.00,0.0,0.00,0.01
16579,Rugby Challenge 3,XOne,2016.0,Sports,Alternative Software,0.00,0.01,0.0,0.00,0.01

In [24]:
# (4-4) 'Year' 컬럼의 타입을 int로 변경하세요.

# NaN 값을 0으로 대치시킨 후 int형 전환
dataDF['Year'] = dataDF['Year'].fillna(0)
dataDF['Year'] = dataDF['Year'].astype(int)
display(dataDF)
dataDF['Year'].dtype

# Int64는 NaN값 허용됨

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
90,Pac-Man,2600,1982,Puzzle,Atari,7.28,0.45,0.0,0.08,7.81
240,Pitfall!,2600,1981,Platform,Activision,4.21,0.24,0.0,0.05,4.50
259,Asteroids,2600,1980,Shooter,Atari,4.00,0.26,0.0,0.05,4.31
545,Missile Command,2600,1980,Shooter,Atari,2.56,0.17,0.0,0.03,2.76
608,Space Invaders,2600,0,Shooter,Atari,2.36,0.14,0.0,0.03,2.53
...,...,...,...,...,...,...,...,...,...,...
16533,Sébastien Loeb Rally Evo,XOne,2016,Racing,Milestone S.r.l,0.00,0.01,0.0,0.00,0.01
16534,Hitman (2016),XOne,2016,Action,Square Enix,0.00,0.01,0.0,0.00,0.01
16565,Mighty No. 9,XOne,2016,Platform,Deep Silver,0.01,0.00,0.0,0.00,0.01
16572,Resident Evil 4 HD,XOne,2016,Shooter,Capcom,0.01,0.00,0.0,0.00,0.01
16579,Rugby Challenge 3,XOne,2016,Sports,Alternative Software,0.00,0.01,0.0,0.00,0.01

dtype('int64')

In [25]:
# (4-5) 게임 이름(Name)에 'Super Mario'가 포함된 게임들만 선택하세요. 

ret_data = dataDF["Name"].str.contains('Super Mario')
display(dataDF[ret_data])

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
54,Super Mario 3D Land,3DS,2011,Platform,Nintendo,4.89,2.99,2.13,0.78,10.79
65,New Super Mario Bros. 2,3DS,2012,Platform,Nintendo,3.66,3.07,2.47,0.63,9.82
4301,Puzzle & Dragons Z + Super Mario Bros. Edition,3DS,2015,Puzzle,Nintendo,0.05,0.05,0.34,0.01,0.46
7,New Super Mario Bros.,DS,2006,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
60,Super Mario 64,DS,2004,Platform,Nintendo,5.08,3.11,1.25,0.98,10.42
22,Super Mario Land,GB,1989,Platform,Nintendo,10.83,2.71,4.18,0.42,18.14
51,Super Mario Land 2: 6 Golden Coins,GB,1992,Adventure,Nintendo,6.16,2.04,2.69,0.29,11.18
185,Super Mario Land 3: Wario Land,GB,1994,Platform,Nintendo,2.49,0.98,1.57,0.15,5.19
201,Super Mario Bros.,GB,1999,Platform,Nintendo,3.40,1.30,0.15,0.22,5.07
163,Super Mario Advance,GBA,2001,Platform,Nintendo,3.14,1.24,0.91,0.20,5.49
165,Super Mario World,GBA,2001,Platform,Nintendo,3.21,1.11,0.95,0.20,5.46
183,Super Mario Bros. 3,GBA,2003,Platform,Nintendo,2.93,1.25,0.83,0.20,5.20
493,Super Mario World 2: Yoshi's Island,GBA,2002,Platform,Nintendo,1.75,0.45,0.62,0.09,2.91
1353,Classic NES Series: Super Mario Bros.,GBA,2004,Platform,Nintendo,0.00,0.00,1.39,0.03,1.43
4590,Famicom Mini: Super Mario Bros. 2,GBA,2004,Platform,Nintendo,0.00,0.00,0.41,0.01,0.42
136,Super Mario Sunshine,GC,2002,Platform,Nintendo,4.01,1.26,0.87,0.17,6.31
1146,Super Mario Strikers,GC,2005,Sports,Nintendo,0.98,0.38,0.20,0.04,1.61
47,Super Mario 64,N64,1996,Platform,Nintendo,6.91,2.85,1.91,0.23,11.89
2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
23,Super Mario Bros. 3,NES,1988,Platform,Nintendo,9.54,3.44,3.84,0.46,17.28
97,Super Mario Bros. 2,NES,1988,Platform,Nintendo,5.39,1.18,0.70,0.19,7.46
574,Super Mario Bros.: The Lost Levels,NES,1986,Platform,Nintendo,0.00,0.00,2.65,0.00,2.65
19,Super Mario World,SNES,1990,Platform,Nintendo,12.78,3.75,3.54,0.55,20.61
58,Super Mario All-Stars,SNES,1993,Platform,Nintendo,5.99,2.15,2.12,0.29,10.55
77,Super Mario Kart,SNES,1992,Racing,Nintendo,3.54,1.24,3.81,0.18,8.76
283,Super Mario World 2: Yoshi's Island,SNES,1995,Platform,Nintendo,1.65,0.61,1.76,0.09,4.12
764,Super Mario RPG: Legend of the Seven Stars,SNES,1996,Role-Playing,Nintendo,0.66,0.00,1.45,0.03,2.14
9,New Super Mario Bros. Wii,Wii,2009,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
49,Super Mario Galaxy,Wii,2007,Platform,Nintendo,6.16,3.40,1.20,0.76,11.52
92,Super Mario Galaxy 2,Wii,2010,Platform,Nintendo,3.66,2.42,0.98,0.64,7.69
588,Super Mario All-Stars: Limited Edition,Wii,2010,Platform,Nintendo,1.02,0.52,0.92,0.14,2.60
184,New Super Mario Bros. U,WiiU,2012,Platform,Nintendo,2.32,1.30,1.27,0.31,5.19
262,Super Mario 3D World,WiiU,2013,Platform,Nintendo,2.11,1.11,0.72,0.30,4.25
430,Super Mario Maker,WiiU,2015,Platform,Nintendo,1.18,0.87,0.93,0.20,3.18

문제 5. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요. <hr>

In [26]:
FILE_NAME = '../Data/titanic.csv'

dataDF = pd.read_csv(FILE_NAME)

In [27]:
# (5-1) 단순 조건에 맞는 데이터만 선택 
# ▶ 성별이 여자인 승객 행만 필터링.
ret_data = dataDF['sex'] == 'female'
display(dataDF[ret_data])

# ▶ pclass가 1등석인 승객만. 
ret_data = dataDF['pclass'] == 1
display(dataDF[ret_data])

# ▶ age가 10세 미만인 어린이만.
ret_data = dataDF['age'] < 10
display(dataDF[ret_data])

# ▶ fare가 100이상인 고가 요금 승객만.
ret_data = dataDF['fare'] >= 100
display(dataDF[ret_data])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.00,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.00,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
16,0,3,male,2.00,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
24,0,3,female,8.00,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
43,1,2,female,3.00,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
827,1,2,male,1.00,0,2,37.0042,C,Second,child,False,NaN,Cherbourg,yes,False
831,1,2,male,0.83,1,1,18.7500,S,Second,child,False,NaN,Southampton,yes,False
850,0,3,male,4.00,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
852,0,3,female,9.00,1,1,15.2458,C,Third,child,False,NaN,Cherbourg,no,False
869,1,3,male,4.00,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
27,0,1,male,19.00,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
88,1,1,female,23.00,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
118,0,1,male,24.00,0,1,247.5208,C,First,man,True,B,Cherbourg,no,False
195,1,1,female,58.00,0,0,146.5208,C,First,woman,False,B,Cherbourg,yes,True
215,1,1,female,31.00,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
258,1,1,female,35.00,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
268,1,1,female,58.00,0,1,153.4625,S,First,woman,False,C,Southampton,yes,False
269,1,1,female,35.00,0,0,135.6333,S,First,woman,False,C,Southampton,yes,True
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
299,1,1,female,50.00,0,1,247.5208,C,First,woman,False,B,Cherbourg,yes,False
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
306,1,1,female,NaN,0,0,110.8833,C,First,woman,False,NaN,Cherbourg,yes,True
307,1,1,female,17.00,1,0,108.9000,C,First,woman,False,C,Cherbourg,yes,False
311,1,1,female,18.00,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
318,1,1,female,31.00,0,2,164.8667,S,First,woman,False,C,Southampton,yes,False
319,1,1,female,40.00,1,1,134.5000,C,First,woman,False,E,Cherbourg,yes,False
325,1,1,female,36.00,0,0,135.6333,C,First,woman,False,C,Cherbourg,yes,True
332,0,1,male,38.00,0,1,153.4625,S,First,man,True,C,Southampton,no,False
334,1,1,female,NaN,1,0,133.6500,S,First,woman,False,NaN,Southampton,yes,False
337,1,1,female,41.00,0,0,134.5000,C,First,woman,False,E,Cherbourg,yes,True
341,1,1,female,24.00,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
373,0,1,male,22.00,0,0,135.6333,C,First,man,True,NaN,Cherbourg,no,True
377,0,1,male,27.00,0,2,211.5000,C,First,man,True,C,Cherbourg,no,False
380,1,1,female,42.00,0,0,227.5250,C,First,woman,False,NaN,Cherbourg,yes,True
390,1,1,male,36.00,1,2,120.0000,S,First,man,True,B,Southampton,yes,False
393,1,1,female,23.00,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
435,1,1,female,14.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
438,0,1,male,64.00,1,4,263.0000,S,First,man,True,C,Southampton,no,False
498,0,1,female,25.00,1,2,151.5500,S,First,woman,False,C,Southampton,no,False
505,0,1,male,18.00,1,0,108.9000,C,First,man,True,C,Cherbourg,no,False
527,0,1,male,NaN,0,0,221.7792,S,First,man,True,C,Southampton,no,True
537,1,1,female,30.00,0,0,106.4250,C,First,woman,False,NaN,Cherbourg,yes,True
544,0,1,male,50.00,1,0,106.4250,C,First,man,True,C,Cherbourg,no,False
550,1,1,male,17.00,0,2,110.8833,C,First,man,True,C,Cherbourg,yes,False
557,0,1,male,NaN,0,0,227.5250,C,First,man,True,NaN,Cherbourg,no,True
581,1,1,female,39.00,1,1,110.8833,C,First,woman,False,C,Cherbourg,yes,False
609,1,1,female,40.00,0,0,153.4625,S,First,woman,False,C,Southampton,yes,True
659,0,1,male,58.00,0,2,113.2750,C,First,man,True,D,Cherbourg,no,False
660,1,1,male,50.00,2,0,133.6500,S,First,man,True,NaN,Southampton,yes,False
679,1,1,male,36.00,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
689,1,1,female,15.00,0,1,211.3375,S,First,child,False,B,Southampton,yes,False
698,0,1,male,49.00,1,1,110.8833,C,First,man,True,C,Cherbourg,no,False
700,1,1,female,18.00,1,0,227.5250,C,First,woman,False,C,Cherbourg,yes,False
708,1,1,female,22.00,0,0,151.5500,S,First,woman,False,NaN,Southampton,yes,True
716,1,1,female,38.00,0,0,227.5250,C,First,woman,False,C,Cherbourg,yes,True
730,1,1,female,29.00,0,0,211.3375,S,First,woman,False,B,Southampton,yes,True
737,1,1,male,35.00,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
742,1,1,female,21.00,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
763,1,1,female,36.00,1,2,120.0000,S,First,woman,False,B,Southampton,yes,False
779,1,1,female,43.00,0,1,211.3375,S,First,woman,False,B,Southampton,yes,False
802,1,1,male,11.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
856,1,1,female,45.00,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False

In [28]:
# (5-2) 아래 조합 조건에 맞는 데이터만 선택
# ▶ 1 또는 2등석인 생존자 데이터만
ret_data = (dataDF['pclass'] == 1) | (dataDF['pclass'] == 2)
display(dataDF[ret_data])

# ▶ 가족 동승 3명 이상) 승객 데이터만
ret_data = dataDF['sibsp'] + dataDF['parch'] >= 3
display(dataDF[ret_data])

# ▶ 혼자 탑승한 성인 남자 데이터만 
ret_data = (dataDF['alone'] == True) & (dataDF['adult_male'] == 'True') 
display(dataDF[ret_data])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
25,1,3,female,38.0,1,5,31.3875,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
850,0,3,male,4.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
858,1,3,female,24.0,0,3,19.2583,C,Third,woman,False,NaN,Cherbourg,yes,False
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []